/**
 * Very big mess of configuration,why these keys so unreadable?
 */
module.exports = {
    LogFromType : {
        P_MONEY_FROM : { '0' : '关卡', '1' : '登录', '2' : '摇钱树', '3' : '小银袋', '4' : '大银袋', '5' : '血战排行', '6' : '开福袋', '7' : '开玄武匣', '8' : '开白虎匣', '9' : '开朱雀匣', '10' : '卖装备',
            '11' : '7天登录', '12' : '升级', '13' : '开VIP礼包', '14' : '通过消息领取', '15' : '充值赠送', '16' : '封神之战', '17' : '好友PK', '18' : '嫦娥', '19' : '女儿国每日礼包',
			'20' : '开活动箱子', '21' : '兑换码',
			'job' : '关卡' , 'login' : '登录' , 'shake_tree' : '摇钱树' , 'open_small_bag' : '小银袋' , 'open_big_bag' : '大银袋' , 'rank_battle' : '血战排行' , 'open_package' : '开福袋',
			'open_xuanwu' : '开玄武匣' , 'open_baihu' : '开白虎匣' , 'open_zhuque' : '开朱雀匣' , 'sell_arm' : '卖装备' , 'login_7' : '7天登录' , 'levelup' : '升级' , 'vip_package' : '开VIP礼包',
			'sys' : '通过消息领取' , 'recharge' : '充值赠送' , 'battle' : '封神之战' , 'friend_pk' : '好友PK' , 'change' : '嫦娥' , 'consume_er_pkg' : '女儿国每日礼包' , 'open_activity_box' : '开活动箱子',
			'exchange' : '兑换码'
		},
        P_GOLD_FROM : { '0' : '登录奖励', '1' : '升级奖励', '2' : '关卡全3星奖励', '3' : '开福袋', '4' : '封神排行榜奖励', '5' : '系统消息奖励', '6' : '充值', '7' : '充值赠送', '8' : '财神奖励', '9' : '升级奖励',
            '10' : '10', '11' : '月卡奖励', '12' : '女儿国奖励', '13' : '缘分加锁', '14' : '缘分解锁', '15' : '注册30天奖励', '16' : '兑换码', '17' : '新用户充值活动',
            'login' : '登录奖励', 'levelup' : '升级奖励', 'job3star' : '关卡全3星奖励', 'open_package' : '开福袋', 'rank_battle' : '封神排行榜奖励', 'sys' : '系统消息奖励', 'buy' : '充值',
            'recharge' : '充值赠送', 'goldgod' : '财神奖励', 'level' : '升级奖励', 'star4card' : 'star4card', 'month_card' : '月卡奖励', 'consume' : '女儿国奖励', 'lock_lot' : '缘分加锁',
            'unlock_lot' : '缘分解锁', '30dr' : '注册30天奖励', 'exchange' : '兑换码', 'login7' : '连续7天登录奖励'
		},
        P_STAMINA_FROM : { '0' : '自然增长', '1' : '元宝买体力', '2' : '吃大桃', '3' : '吃小桃', '4' : '升级', '5' : '定时吃桃', '6' : '3星关卡',
			'nature' : '自然增长', 'gold' : '元宝买体力', 'big_peach' : '吃大桃', 'small_peach' : '吃小桃', 'levelup' : '升级', 'lunch' : '定时吃桃', 'job3star' : '3星关卡'
		},
        P_GHOST_FROM : { '0' : '登录奖励', '1' : '副本', '2' : '卡牌遣散', '3' : '天宫10', '4' : '天宫100', '5' : '天宫10000', '6' : '天宫免费10', '7' : '天宫免费100', '8' : '天宫免费10000',
			'9' : '新手引导', '10' : 'VIP礼包', '11' : '关卡全局掉落', '12' : '关卡活动掉落', '13' : '排行榜', '14' : '充值赠送', '15' : '系统赠送', '16' : '兑换码', '17' : '中秋活动',
			'18' : '中秋兑换', '19' : '嫦娥', '20' : '第一魂魄', '21' : '炼魂', '22' : '女儿国每日礼包', '23' : '开活动箱子', '24' : '魂魄活动赠送', '25' : '10连抽',
			'login' : '登录奖励', 'inst' : '副本', 'breakup' : '卡牌遣散', 'pay_10' : '天宫10', 'pay_100' : '天宫100', 'pay_10000' : '天宫10000', 'free_10' : '天宫免费10',
			'free_100' : '天宫免费100', 'free_10000' : '天宫免费10000', 'guide' : '新手引导', 'vip_package' : 'VIP礼包', 'global_drop' : '关卡全局掉落', 'activy_drop' : '关卡活动掉落',
			'rank_battle' : '排行榜', 'recharge' : '充值赠送', 'sys' : '系统赠送', 'exchange_code' : '兑换码', 'mooncake' : '中秋活动', 'mooncake_exchange' : '中秋兑换',
			'change' : '嫦娥', 'firstghost' : '第一魂魄', 'combine' : '炼魂', 'consume_er_pkg' : '女儿国每日礼包', 'open_activity_box' : '开活动箱子', 'ghost_activity' : '魂魄活动赠送',
			'buy_10_card' : '10连抽'
			  },
        P_PROP_FROM : { '0' : '福袋', '1' : '开玄武匣', '2' : '开白虎匣', '3' : '开朱雀匣', '4' : '开福袋', '5' : '血战掉落', '6' : 'VIP礼包', '7' : '铁匠铺', '8' : '消息领取',
            '9' : '论剑积分兑换', '10' : '论剑排名奖励', '11' : '关卡额外奖励', '12' : '关卡全局掉落', '13' : '关卡活动掉落', '14' : '充值', '15' : '登录', '16' : '7天登录',
            '17' : '升级阵法书', '18' : '买VIP礼包', '19' : '血战排行', '20' : '充值赠送', '21' : '兑换码', '22' : '升级', '23' : '4星战将奖励', '24' : '中秋活动', '25' : 'NONE',
            '26' : '三清殿奖励', '27' : '嫦娥奖励', '28' : '六道轮回', '29' : '经书盒子', '30' : '阅历兑换', '31' : '遣散', '32' : '国庆节活动', '33' : '牛魔王陈香活动', '34' : '女儿国每日礼包',
            '35' : '缘分加锁', '36' : '缘分解锁', '37' : '开活动箱子', '38' : '出售装备', '39' : '注册30天奖励',
            'package' : '福袋', 'open_xuanwu' : '开玄武匣', 'open_baihu' : '开白虎匣', 'open_zhuque' : '开朱雀匣', 'open_package' : '开福袋', 'battle' : '血战掉落',
            'vip_package' : 'VIP礼包', 'smithy' : '铁匠铺', 'sys' : '消息领取', 'exchange' : '论剑积分兑换', 'rank_reward' : '论剑排名奖励', 'job_extra_reward' : '关卡额外奖励',
            'job_global_drop' : '关卡全局掉落', 'job_activy_drop' : '关卡活动掉落', 'buy' : '充值', 'login' : '登录', 'login_7' : '7天登录', 'levelup_matrixbook' : '升级阵法书',
            'buy_vip_package' : '买VIP礼包', 'rank_battle' : '血战排行', 'recharge' : '充值赠送', 'exchange_code' : '兑换码', 'level' : '升级', 'star4card' : '4星战将奖励',
            'mooncake_exchange' : '中秋活动', 'none' : 'NONE', 'sanq' : '三清殿奖励', 'change' : '嫦娥奖励', 'inst' : '六道轮回', 'buff' : '经书盒子', 'score' : '阅历兑换', 'percent_breakup' : '遣散',
            'nationalday' : '国庆节活动', 'niumochenxiang' : '牛魔王陈香活动', 'consume_er_pkg' : '女儿国每日礼包', 'lock_lot' : '缘分加锁', 'unlock_lot' : '缘分解锁', 'open_activity_box' : '开活动箱子',
            'arm_sell' : '出售装备', '30dr' : '注册30天奖励', 'guide_reward' : '引导奖励', 'login7' : '连续7天登录奖励'
		},
		P_ARM_FROM : { '0' : '开福袋', '1' : '消息领取', '2' : '新手引导', '3' : '关卡额外奖励', '4' : '关卡全局掉落', '5' : '关卡活动掉落', '6' : '开玄武匣', '7' : '开白虎匣', '8' : '开朱雀匣',
            '9' : '登录', '10' : '7天登录', '11' : '血战排行', '12' : '充值赠送', '13' : '新手赠送1星武器', '14' : '兑换码', '15' : '等级奖励', '16' : '收集卡牌奖励',
            '17' : '嫦娥奖励', '18' : '开VIP包', '19' : '女儿国每日礼包', '20' : '开活动箱子', '21' : '注册30天奖励',
            'open_package' : '开福袋', 'sys' : '消息领取', 'guide' : '新手引导', 'job_extra_reward' : '关卡额外奖励', 'job_global_drop' : '关卡全局掉落', 'job_activy_drop' : '关卡活动掉落',
            'open_xuanwu' : '开玄武匣', 'open_baihu' : '开白虎匣', 'open_zhuque' : '开朱雀匣', 'login' : '登录', 'login_7' : '7天登录', 'rank_battle' : '血战排行', 'recharge' : '充值赠送',
            'guide_reward' : '新手赠送1星武器', 'exchange_code' : '兑换码', 'level' : '等级奖励', 'star4card' : '收集卡牌奖励', 'change' : '嫦娥奖励', 'vip_package' : '开VIP包',
            'consume_er_pkg' : '女儿国每日礼包', 'open_activity_box' : '开活动箱子', '30dr' : '注册30天奖励'
		},
		P_EXP_FROM : { '0' : '普通遣散', '1' : '完美遣散', '2' : '经验书', '3' : '引导', '4' : '三清殿',
		    'normal' : '普通遣散', 'perfect' : '完美遣散', 'book' : '经验书', 'guide' : '引导', 'sanq' : '三清殿'
		},
        P_LOT_FROM : { '0' : '元宝修缘', '1' : '道具修缘', '2' : '接受修缘', '3' : '放弃修缘',
		    'gold' : '元宝修缘', 'prop' : '道具修缘', 'accept' : '接受修缘', 'deny' : '放弃修缘', 'confirm_lot' : '修缘确认', 'cancel_lot' : '修缘取消'
		},
        P_SCORE_FROM : { '0' : '领取消耗元宝', '1' : '出售经书', '2' : '完成每日任务领取', '3' : '开启道具获得阅历', '4' : '元宝产生预备阅历',
			'gold' : '领取消耗元宝', 'buff' : '出售经书', 'task' : '完成每日任务领取', 'prop' : '开启道具获得阅历', 'prescore' : '元宝产生预备阅历'
		},
        P_FOSTER_FROM : { '0' : '正常培养', '1' : '消耗元宝培养',
			 'normal' : '正常培养', 'gold' : '消耗元宝培养'
		},
        P_BUFF_FROM : { '0' : '开箱子', '1' : '开活动箱子',
		    'openbox' : '开箱子', 'open_activity_box' : '开活动箱子'
		},
		P_CARD_FROM : { '0' : '商店抽将', '1' : '合魂招将', '2' : '十里抽魂', '3' : '百里抽魂', '4' : '万里抽魂', '5' : '免费十里抽魂', '6' : '免费百里抽魂', '7' : '免费万里抽魂', '8' : '引导', 
            '9' : '十连抽(buy_ten)','buy' : '商店抽将', 'call' : '合魂招将', 'pay_10' : '十里抽魂', 'pay_100' : '百里抽魂', 'pay_10000' : '万里抽魂', 'free_10' : '免费十里抽魂', 
            'free_100' : '免费百里抽魂','free_10000' : '免费万里抽魂', 'guide' : '引导', 'buy_ten' : '十连抽(buy_ten)'
		},

        D_MONEY_FROM : { '0' : '升级武器', '1' : '升级防具', '2' : '升级饰品', '3' : '升级法宝', '4' : '升级技能', '5' : '学习技能', '6' : '经书升级',
			'upgrade_arm_1' : '升级武器', 'upgrade_arm_2' : '升级防具', 'upgrade_arm_3' : '升级饰品', 'upgrade_arm_4' : '升级法宝',
			'upgrade_skill' : '升级技能', 'learn_skill' : '学习技能', 'upgrade_buff' : '经书升级'
		},
		D_GOLD_FROM : { '0' : '十里招魂', '1' : '百里招魂', '2' : '万里招魂', '3' : '十里招魂(怒气)', '4' : '百里招魂(怒气)', '5' : '万里招魂(怒气)', '6' : '用户引导', '7' : '天宫买道具',
            '8' : '清除挑战次数', '9' : '购买体力', '10' : '修缘', '11' : '重置副本', '12' : '完美遣散', '13' : '战斗道具', '14' : 'VIP礼包', '15' : '查看阵型', '16' : '培养',
            '17' : '贡财神', '18' : '三清殿', '19' : '消除关卡冷却时间', '20' : '10连抽', '21' : '缘分加锁', '22' : '缘分解锁',
            'pay_10' : '十里招魂', 'pay_100' : '百里招魂', 'pay_10000' : '万里招魂', 'pay_10_anger' : '十里招魂(怒气)', 'pay_100_anger' : '百里招魂(怒气)', 'pay_10000_anger' : '万里招魂(怒气)',
            'guide' : '用户引导', 'tj_prop' : '天宫买道具', 'clear_challenge' : '清除挑战次数', 'stamina' : '购买体力', 'lot' : '修缘', 'reset_inst' : '重置副本', 'breakup' : '完美遣散',
            'fight_prop' : '战斗道具', 'vip_package' : 'VIP礼包', 'fight_inspect' : '查看阵型', 'foster' : '培养', 'goldgod' : '贡财神', 'sanq' : '三清殿', 'remove_cold' : '消除关卡冷却时间',
            'con_10' : '10连抽', 'lock_lot' : '缘分加锁', 'unlock_lot' : '缘分解锁', 'buy_prop' : '购买道具'
		},
		D_STAMINA_FROM : { '0' : '普通关卡', '1' : '小boss', '2' : '大boss', '3' : '副本', '4' : 'pk', '5' : '朋友pk',
		    'job' : '普通关卡', 'small_boss' : '小boss', 'big_boss' : '大boss', 'inst' : '副本', 'pk' : '挑战', 'friend_pk' : '朋友pk'
		},
		D_GHOST_FROM : { '0' : '阵型', '1' : '渡劫', '2' : '合成战将', '3' : '道具', '4' : '炼魂',
			'soul' : '阵型', 'dujie' : '渡劫', 'call' : '合成战将', 'prop' : '道具', 'combine' : '炼魂'
		},
		D_PROP_FROM : { '0' : '开福袋', '1' : '洗缘分', '2' : '吃大桃', '3' : '吃小桃', '4' : '改名', '5' : '开VIP礼包', '6' : '完美遣散', '7' : '开白虎匣', '8' : '开玄武匣',
            '9' : '开朱雀匣', '10' : '开大钱袋', '11' : '开小钱袋', '12' : '经验书', '13' : '战斗道具', '14' : '学习阵法书', '15' : '技能升级', '16' : '重置副本',
            '17' : '培养', '18' : '魂魄道具', '19' : '三清殿', '20' : '炼魂', '21' : '经书升级', '22' : '经书盒子', '23' : '潜力道具', '24' : '阅历道具', '25' : '开活动箱子',
            '26' : '装备精炼', '27' : '缘分加锁', '28' : '缘分解锁',
            'open_package' : '开福袋', 'refresh_lot' : '洗缘分', 'big_peach' : '吃大桃', 'small_peach' : '吃小桃', 'change_name' : '改名', 'open_vip_package' : '开VIP礼包',
            'percent_breakup' : '完美遣散', 'open_baihu' : '开白虎匣', 'open_xuanwu' : '开玄武匣', 'open_zhuque' : '开朱雀匣', 'open_big_bag' : '开大钱袋', 'open_small_bag' : '开小钱袋',
            'use_exp_book' : '经验书', 'use_fight_prop' : '战斗道具', 'learn_matrix_book' : '学习阵法书', 'skill_upgrade' : '技能升级', 'reset_inst' : '重置副本', 'foster' : '培养',
            'ghost' : '魂魄道具', 'sanq' : '三清殿', 'combine' : '炼魂', 'buff_upgrade' : '经书升级', 'buff_box' : '经书盒子', 'add_pot' : '潜力道具', 'score' : '阅历道具', 'open_activity_box' : '开活动箱子',
            'arm_refine' : '装备精炼', 'lock_lot' : '缘分加锁', 'unlock_lot' : '缘分解锁', 'mooncake_exchange' : '中秋兑换'
		},
        D_ARM_FROM : { '0' : '卖装备', 'sell' : '卖装备'},
        D_EXP_FROM : { '0' : '突飞', '1' : '三清殿', 'pass_exp' : '突飞', 'sanq' : '三清殿'},
        D_LOT_FROM : { '0' : 'NONE', 'none' : 'NONE'},
        D_SCORE_FROM : { '0' : '兑换经书盒子', '1' : '兑换潜力道具', 'buff' : '兑换经书盒子', 'potprop' : '兑换潜力道具'},
        D_FOSTER_FROM : { '0' : '正常培养', '1' : '消耗元宝培养', 'normal' : '正常培养', 'gold' : '消耗元宝培养'},
        D_BUFF_FROM : { '0' : '出售', 'sell' : '出售'},
        D_CARD_FROM : { '0' : '遣散', 'breakup' : '遣散'}
    }
};